selfcheck/incompressible/pimpleFoam/elipsekkLOmega/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.1 0 0);

boundaryField
{
    outlet
    {
       type             inletOutlet;
       inletValue       uniform (0 0 0);
       inlet            uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (3.1 0 0);
    }
    up
    {
        type            symmetry;
    }
    hole
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
